constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    In
    {
        type            patch;
        nFaces          140;
        startFace       89140;
    }
    Out
    {
        type            patch;
        nFaces          140;
        startFace       89280;
    }
    Bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          320;
        startFace       89420;
    }
    Top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          320;
        startFace       89740;
    }
    DefaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          89600;
        startFace       90060;
    }
)

// ************************************************************************* //
