0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);



boundaryField
{

    In
    {
        type            fixedValue;
        value           uniform (2e-2 0 0);
    }

    Out
    {

        type            zeroGradient;

    }

    Top
    {
        type            noSlip;

    }

    Bottom
    {
	type            noSlip;


    }


    DefaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
