0/c_Bot_P1_L
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c_Bot_P1_L;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    In
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    Out
    {
        type            zeroGradient;
    }
    
    Top
    {
        type            zeroGradient;
    }
    
    Bottom
    {
        type            zeroGradient;
    }
    
    DefaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
