0/tau
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

/*------------*\
  13.10.2025
  =========     
  \\sofian/  
   \\Sakr/ 
    \\  /    
     \\/     
\*-----------*/

FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];  // Time [seconds]

internalField   uniform 0;

boundaryField
{
    In
    {
        type            fixedValue;
        value           uniform 0;  // Fresh gas has zero residence time
    }
    
    Out
    {
        type            zeroGradient;  // Carries accumulated time out
    }
    
    Top
    {
        type            zeroGradient;
    }
    
    Bottom
    {
        type            zeroGradient;
    }
    
    DefaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
