system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(c)         Gauss linear;
    grad(tau)       Gauss linear;
    // Add gradient schemes for region fields using wildcards
    "grad\(c_.*\)"     Gauss linear;
    "grad\(tau_.*\)"   Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(phi,c)      Gauss linearUpwind grad(c);
    div(phi,tau)    Gauss linearUpwind grad(tau);
    // Add divergence schemes for all region fields
    "div\(phi,c_.*\)"     Gauss linearUpwind grad(c);
    "div\(phi,tau_.*\)"   Gauss linearUpwind grad(tau);
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
    laplacian(Dc,c) Gauss linear orthogonal;
    laplacian(Dc,tau) Gauss linear orthogonal;
    // Add laplacian schemes for all region fields
    "laplacian\(Dc,c_.*\)"     Gauss linear orthogonal;
    "laplacian\(Dc,tau_.*\)"   Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //
