system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// ************************************************************************* //
boundary
{
    Bottom
    {
        type wall;
        physicalType    wall;
    }

    Top
    {
        type wall;
        physicalType    wall;
    }

    In
    {
        type patch;
        physicalType    patch;
    }

    Out
    {
        type patch;
        physicalType    patch;
    }

    defaultFaces
    {
        type empty;
    }
}



// ************************************************************************* //
