system/extractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*--------------------------------*- C++ -*----------------------------------*
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            volFieldValue;
libs            ("libfieldFunctionObjects.so");
fields          (U p);
operation       none;
writeFields     true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
