system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;
setFormat       csv;

sets
(
    regularGrid
    {
        type        uniform;
        axis        xyz;
        start       (0.001 0.001 0);
        end         (0.049 0.014 0.001);
        nPoints     100000;
    }
);

fields (U p vorticity);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
